FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
/*
 * Copyright 2018-2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <string.h>

#include "fsl_component_serial_manager.h"
#include "fsl_component_serial_port_internal.h"
#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )

    #include "fsl_component_generic_list.h"

/*
 * The OSA_USED macro can only be defined when the OSA component is used.
 * If the source code of the OSA component does not exist, the OSA_USED cannot be defined.
 * OR, If OSA component is not added into project event the OSA source code exists, the OSA_USED
 * also cannot be defined.
 * The source code path of the OSA component is <MCUXpresso_SDK>/components/osa.
 *
 */
    #if defined( OSA_USED )

        #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
            #include "fsl_component_common_task.h"
        #else
            #include "fsl_os_abstraction.h"
        #endif

    #endif

#endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#ifndef NDEBUG
    #if ( defined( DEBUG_CONSOLE_ASSERT_DISABLE ) && ( DEBUG_CONSOLE_ASSERT_DISABLE > 0U ) )
        #undef assert
        #define assert( n )
    #else
/* MISRA C-2012 Rule 17.2 */
        #undef assert
        #define assert( n ) \
    while( !( n ) )         \
    {                       \
        ;                   \
    }
    #endif
#endif /* ifndef NDEBUG */

/* Weak function. */
#if defined( __GNUC__ )
    #define __WEAK_FUNC                 __attribute__( ( weak ) )
#elif defined( __ICCARM__ )
    #define __WEAK_FUNC                 __weak
#elif defined( __CC_ARM ) || defined( __ARMCC_VERSION )
    #define __WEAK_FUNC                 __attribute__( ( weak ) )
#endif

#define SERIAL_EVENT_DATA_RECEIVED      ( 1U << 0 )
#define SERIAL_EVENT_DATA_SENT          ( 1U << 1 )
#define SERIAL_EVENT_DATA_START_SEND    ( 1U << 2 )
#define SERIAL_EVENT_DATA_RX_NOTIFY     ( 1U << 3 )

#define SERIAL_MANAGER_WRITE_TAG        0xAABB5754U
#define SERIAL_MANAGER_READ_TAG         0xBBAA5244U

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
    typedef enum _serial_manager_transmission_mode
    {
        kSerialManager_TransmissionBlocking = 0x0U,    /*!< Blocking transmission*/
        kSerialManager_TransmissionNonBlocking = 0x1U, /*!< None blocking transmission*/
    } serial_manager_transmission_mode_t;

/* TX transfer structure */
    typedef struct _serial_manager_transfer
    {
        uint8_t * buffer;
        volatile uint32_t length;
        volatile uint32_t soFar;
        serial_manager_transmission_mode_t mode;
        serial_manager_status_t status;
    } serial_manager_transfer_t;
#endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

/* write handle structure */
typedef struct _serial_manager_send_handle
{
    struct _serial_manager_handle * serialManagerHandle;
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        list_element_t link; /*!< list element of the link */
        serial_manager_transfer_t transfer;
        serial_manager_callback_t callback;
        void * callbackParam;
        uint32_t tag;
    #endif
} serial_manager_write_handle_t;
typedef struct _serial_manager_send_block_handle
{
    struct _serial_manager_handle * serialManagerHandle;
} serial_manager_write_block_handle_t;

typedef serial_manager_write_handle_t         serial_manager_read_handle_t;
typedef serial_manager_write_block_handle_t   serial_manager_read_block_handle_t;

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
/* receive state structure */
    typedef struct _serial_manager_read_ring_buffer
    {
        uint8_t * ringBuffer;
        uint32_t ringBufferSize;
        volatile uint32_t ringHead;
        volatile uint32_t ringTail;
    } serial_manager_read_ring_buffer_t;

    typedef struct _serial_manager_block_handle
    {
        serial_manager_type_t handleType;
        serial_port_type_t type;
        serial_manager_read_handle_t * volatile openedReadHandleHead;
        volatile uint32_t openedWriteHandleCount;
        union
        {
            uint32_t lowLevelhandleBuffer[ 1 ];
            #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
                uint8_t uartHandleBuffer[ SERIAL_PORT_UART_BLOCK_HANDLE_SIZE ];
            #endif
        };
    } serial_manager_block_handle_t;
#endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

#if defined( __CC_ARM )
    #pragma anon_unions
#endif
/* The serial manager handle structure */
typedef struct _serial_manager_handle
{
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        serial_manager_type_t handleType;
    #endif
    serial_port_type_t type;
    serial_manager_read_handle_t * volatile openedReadHandleHead;
    volatile uint32_t openedWriteHandleCount;
    union
    {
        uint32_t lowLevelhandleBuffer[ 1 ];
        #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
            uint8_t uartHandleBuffer[ SERIAL_PORT_UART_HANDLE_SIZE ];
        #endif
        #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
            uint8_t usbcdcHandleBuffer[ SERIAL_PORT_USB_CDC_HANDLE_SIZE ];
        #endif
        #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
            uint8_t swoHandleBuffer[ SERIAL_PORT_SWO_HANDLE_SIZE ];
        #endif
        #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
            uint8_t usbcdcVirtualHandleBuffer[ SERIAL_PORT_VIRTUAL_HANDLE_SIZE ];
        #endif
        #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
            uint8_t rpmsgHandleBuffer[ SERIAL_PORT_RPMSG_HANDLE_SIZE ];
        #endif
    };
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        serial_manager_read_ring_buffer_t ringBuffer;
    #endif

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        #if defined( OSA_USED )
            #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                common_task_message_t commontaskMsg;
            #else
                OSA_EVENT_HANDLE_DEFINE( event ); /*!< Event instance */
                OSA_TASK_HANDLE_DEFINE( taskId ); /*!< Task handle */
            #endif
        #endif
    #endif
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        list_label_t runningWriteHandleHead;   /*!< The queue of running write handle */
        list_label_t completedWriteHandleHead; /*!< The queue of completed write handle */
    #endif
} serial_manager_handle_t;

