FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
/*******************************************************************************
 * Prototypes
 ******************************************************************************/

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
    static void SerialManager_Task( void * param );
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )

    #if defined( OSA_USED )

        #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )

        #else

/*
 * \brief Defines the serial manager task's stack
 */
            static OSA_TASK_DEFINE( SerialManager_Task, SERIAL_MANAGER_TASK_PRIORITY, 1, SERIAL_MANAGER_TASK_STACK_SIZE, false );
        #endif

    #endif

#endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

/*******************************************************************************
 * Code
 ******************************************************************************/

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
    static void SerialManager_AddTail( list_label_t * queue,
                                       serial_manager_write_handle_t * node )
    {
        ( void ) LIST_AddTail( queue, &node->link );
    }

    static void SerialManager_RemoveHead( list_label_t * queue )
    {
        ( void ) LIST_RemoveHead( queue );
    }
#endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )

    static serial_manager_status_t SerialManager_StartWriting( serial_manager_handle_t * handle )
    {
        serial_manager_status_t status = kStatus_SerialManager_Error;
        serial_manager_write_handle_t * writeHandle =
            ( serial_manager_write_handle_t * ) ( void * ) LIST_GetHead( &handle->runningWriteHandleHead );

        if( writeHandle != NULL )
        {
            writeHandle = ( serial_manager_write_handle_t * ) ( ( uint32_t ) writeHandle - 4U );

            switch( handle->type )
            {
                #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
                    case kSerialPort_Uart:
                        status = Serial_UartWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                   writeHandle->transfer.buffer, writeHandle->transfer.length );
                        break;
                #endif
                #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
                    case kSerialPort_UsbCdc:
                        status = Serial_UsbCdcWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                     writeHandle->transfer.buffer, writeHandle->transfer.length );
                        break;
                #endif
                #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
                    case kSerialPort_Swo:
                        status = Serial_SwoWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                  writeHandle->transfer.buffer, writeHandle->transfer.length );
                        break;
                #endif
                #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
                    case kSerialPort_Virtual:
                        status = Serial_PortVirtualWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                          writeHandle->transfer.buffer, writeHandle->transfer.length );
                        break;
                #endif
                #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
                    case kSerialPort_Rpmsg:
                        status = Serial_RpmsgWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                    writeHandle->transfer.buffer, writeHandle->transfer.length );
                        break;
                #endif
                default:
                    status = kStatus_SerialManager_Error;
                    break;
            }
        }

        return status;
    }
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE > 0U ) )
        static serial_manager_status_t SerialManager_StartBlockWriting( serial_manager_handle_t * handle,
                                                                        serial_manager_write_handle_t * writeHandle,
                                                                        uint8_t * buffer,
                                                                        uint32_t length )
        {
            serial_manager_status_t status = kStatus_SerialManager_Error;

            #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
                if( kSerialPort_Uart == handle->type ) /* Serial port UART */
                {
                    status = Serial_UartWriteBlocking( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                }
                else
            #endif
            #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
                if( kSerialPort_UsbCdc == handle->type ) /* Serial port UsbCdc */
                {
                    status = Serial_UsbCdcWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                }
                else
            #endif
            #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
                if( kSerialPort_Swo == handle->type ) /* Serial port SWO */
                {
                    status = Serial_SwoWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                }
                else
            #endif
            #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
                if( kSerialPort_Virtual == handle->type ) /* Serial port UsbCdcVirtual */
                {
                    status = Serial_PortVirtualWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                }
                else
            #endif
            #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
                if( kSerialPort_Rpmsg == handle->type ) /* Serial port RPMSG */
                {
                    status = Serial_RpmsgWriteBlocking( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                }
                else
            #endif
            {
                /*MISRA rule*/
            }

