FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
            return status;
        }

    #endif /* SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE */
    static serial_manager_status_t SerialManager_StartReading( serial_manager_handle_t * handle,
                                                               serial_manager_read_handle_t * readHandle,
                                                               uint8_t * buffer,
                                                               uint32_t length )
    {
        serial_manager_status_t status = kStatus_SerialManager_Error;

        if( NULL != readHandle )
        {
            #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
                #if ( defined( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE > 0U ) )
                    if( ( kSerialPort_Uart == handle->type ) &&
                        ( kSerialManager_Blocking == handle->handleType ) ) /* Serial port UART */
                    {
                        status = Serial_UartRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                    }
                #endif /* SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE */
            #endif
            #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
                if( handle->type == kSerialPort_UsbCdc )
                {
                    status = Serial_UsbCdcRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                }
            #endif
            #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
                if( handle->type == kSerialPort_Virtual )
                {
                    status = Serial_PortVirtualRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                }
            #endif
            #if 0
                #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
                    if( handle->type == kSerialPort_Rpmsg )
                    {
                        status = Serial_RpmsgRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
                    }
                #endif
            #endif
        }

        return status;
    }

#else /*SERIAL_MANAGER_NON_BLOCKING_MODE > 0U*/

    static serial_manager_status_t SerialManager_StartWriting( serial_manager_handle_t * handle,
                                                               serial_manager_write_handle_t * writeHandle,
                                                               uint8_t * buffer,
                                                               uint32_t length )
    {
        serial_manager_status_t status = kStatus_SerialManager_Error;

        #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
            if( kSerialPort_Uart == handle->type ) /* Serial port UART */
            {
                status = Serial_UartWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
            if( kSerialPort_UsbCdc == handle->type ) /* Serial port UsbCdc */
            {
                status = Serial_UsbCdcWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
            if( kSerialPort_Swo == handle->type ) /* Serial port SWO */
            {
                status = Serial_SwoWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
            if( kSerialPort_Virtual == handle->type ) /* Serial port UsbCdcVirtual */
            {
                status = Serial_PortVirtualWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
            if( kSerialPort_Rpmsg == handle->type ) /* Serial port Rpmsg */
            {
                status = Serial_RpmsgWrite( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        {
            /*MISRA rule*/
        }

        return status;
    }

    static serial_manager_status_t SerialManager_StartReading( serial_manager_handle_t * handle,
                                                               serial_manager_read_handle_t * readHandle,
                                                               uint8_t * buffer,
                                                               uint32_t length )
    {
        serial_manager_status_t status = kStatus_SerialManager_Error;

        #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
            if( kSerialPort_Uart == handle->type ) /* Serial port UART */
            {
                status = Serial_UartRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
            if( kSerialPort_UsbCdc == handle->type ) /* Serial port UsbCdc */
            {
                status = Serial_UsbCdcRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
            if( kSerialPort_Swo == handle->type ) /* Serial port SWO */
            {
                status = Serial_SwoRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
            if( kSerialPort_Virtual == handle->type ) /* Serial port UsbCdcVirtual */
            {
                status = Serial_PortVirtualRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
            if( kSerialPort_Rpmsg == handle->type ) /* Serial port UsbCdcVirtual */
            {
                status = Serial_RpmsgRead( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), buffer, length );
            }
            else
        #endif
        {
            /*MISRA rule*/
        }

