FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
        return status;
    }
#endif /*SERIAL_MANAGER_NON_BLOCKING_MODE > 0U*/

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
    static void SerialManager_IsrFunction( serial_manager_handle_t * handle )
    {
        uint32_t regPrimask = DisableGlobalIRQ();

        switch( handle->type )
        {
            #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
                case kSerialPort_Uart:
                    Serial_UartIsrFunction( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
                case kSerialPort_UsbCdc:
                    Serial_UsbCdcIsrFunction( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
                case kSerialPort_Swo:
                    Serial_SwoIsrFunction( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
                case kSerialPort_Virtual:
                    Serial_PortVirtualIsrFunction( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            default:
                /*MISRA rule 16.4*/
                break;
        }

        EnableGlobalIRQ( regPrimask );
    }

    static void SerialManager_Task( void * param )
    {
        serial_manager_handle_t * handle = ( serial_manager_handle_t * ) param;
        serial_manager_write_handle_t * serialWriteHandle;
        serial_manager_read_handle_t * serialReadHandle;
        uint32_t primask;
        serial_manager_callback_message_t msg;

        #if ( defined( SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY ) && ( SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY > 0U ) )
            uint32_t ringBufferLength;
        #endif /* SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY */

        if( NULL != handle )
        {
            #if defined( OSA_USED )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                #else
                    osa_event_flags_t ev = 0;

                    do
                    {
                        if( KOSA_StatusSuccess ==
                            OSA_EventWait( ( osa_event_handle_t ) handle->event, osaEventFlagsAll_c, 0U, osaWaitForever_c, &ev ) )
                        {
                #endif
            #endif /* if defined( OSA_USED ) */
            #if defined( OSA_USED )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                #else
                    if( 0U != ( ev & SERIAL_EVENT_DATA_START_SEND ) )
                #endif
            #endif
            {
                ( void ) SerialManager_StartWriting( handle );
            }

            #if defined( OSA_USED )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                #else
                    if( 0U != ( ev & SERIAL_EVENT_DATA_SENT ) )
                #endif
            #endif
            {
                serialWriteHandle =
                    ( serial_manager_write_handle_t * ) ( void * ) LIST_GetHead( &handle->completedWriteHandleHead );

                while( NULL != serialWriteHandle )
                {
                    serialWriteHandle = ( serial_manager_write_handle_t * ) ( ( uint32_t ) serialWriteHandle - 4U );
                    SerialManager_RemoveHead( &handle->completedWriteHandleHead );
                    msg.buffer = serialWriteHandle->transfer.buffer;
                    msg.length = serialWriteHandle->transfer.soFar;
                    serialWriteHandle->transfer.buffer = NULL;

                    if( NULL != serialWriteHandle->callback )
                    {
                        serialWriteHandle->callback( serialWriteHandle->callbackParam, &msg,
                                                     serialWriteHandle->transfer.status );
                    }

                    serialWriteHandle =
                        ( serial_manager_write_handle_t * ) ( void * ) LIST_GetHead( &handle->completedWriteHandleHead );
                }
            }

            #if defined( OSA_USED )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                #else
                    if( 0U != ( ev & SERIAL_EVENT_DATA_RECEIVED ) )
                #endif
            #endif
            {
                primask = DisableGlobalIRQ();
                serialReadHandle = handle->openedReadHandleHead;
                EnableGlobalIRQ( primask );

                if( NULL != serialReadHandle )
                {
                    if( NULL != serialReadHandle->transfer.buffer )
                    {
                        if( serialReadHandle->transfer.soFar >= serialReadHandle->transfer.length )
                        {
                            msg.buffer = serialReadHandle->transfer.buffer;
                            msg.length = serialReadHandle->transfer.soFar;
                            serialReadHandle->transfer.buffer = NULL;

                            if( NULL != serialReadHandle->callback )
                            {
                                serialReadHandle->callback( serialReadHandle->callbackParam, &msg,
                                                            serialReadHandle->transfer.status );
                            }
                        }
                    }
                }
            }

            #if ( defined( SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY ) && ( SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY > 0U ) )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                #else
                    if( 0U != ( ev & SERIAL_EVENT_DATA_RX_NOTIFY ) )
                #endif
                {
                    ringBufferLength =
                        handle->ringBuffer.ringHead + handle->ringBuffer.ringBufferSize - handle->ringBuffer.ringTail;
                    ringBufferLength = ringBufferLength % handle->ringBuffer.ringBufferSize;

                    /* Notify there are data in ringbuffer */
                    if( 0U != ringBufferLength )
                    {
                        msg.buffer = NULL;
                        msg.length = ringBufferLength;

                        if( ( NULL != handle->openedReadHandleHead ) && ( NULL != handle->openedReadHandleHead->callback ) )
                        {
                            handle->openedReadHandleHead->callback( handle->openedReadHandleHead->callbackParam, &msg,
                                                                    kStatus_SerialManager_Notify );
                        }
                    }
                }
            #endif /* SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY */

            #if defined( OSA_USED )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
            #else
        }
    }

    while( 0U != gUseRtos_c )
    {
    }
                #endif
            #endif
        }
    }
#endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
    static void SerialManager_TxCallback( void * callbackParam,
                                          serial_manager_callback_message_t * message,
                                          serial_manager_status_t status )
    {
        serial_manager_handle_t * handle;
        serial_manager_write_handle_t * writeHandle;

        assert( NULL != callbackParam );
        assert( NULL != message );

        handle = ( serial_manager_handle_t * ) callbackParam;

