FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
        if( NULL != handle->openedReadHandleHead )
        {
            ( void ) SerialManager_StartReading( handle, handle->openedReadHandleHead, NULL, ringBufferLength );
        }

        EnableGlobalIRQ( primask );
    }

/*
 * This function is used for perdiodic check if the transfer is complete, and will be called in blocking transfer at
 * non-blocking mode. The perdiodic unit is ms and default value is define by
 * SERIAL_MANAGER_WRITE_TIME_DELAY_DEFAULT_VALUE/SERIAL_MANAGER_READ_TIME_DELAY_DEFAULT_VALUE. The function
 * SerialManager_WriteTimeDelay()/SerialManager_ReadTimeDelay() is a weak function, so it could be re-implemented by
 * upper layer.
 */
    __WEAK_FUNC void SerialManager_WriteTimeDelay( uint32_t ms );
    __WEAK_FUNC void SerialManager_WriteTimeDelay( uint32_t ms )
    {
        #if defined( OSA_USED )
            OSA_TimeDelay( ms );
        #endif
    }

    __WEAK_FUNC void SerialManager_ReadTimeDelay( uint32_t ms );
    __WEAK_FUNC void SerialManager_ReadTimeDelay( uint32_t ms )
    {
        #if defined( OSA_USED )
            OSA_TimeDelay( ms );
        #endif
    }

    static serial_manager_status_t SerialManager_Write( serial_write_handle_t writeHandle,
                                                        uint8_t * buffer,
                                                        uint32_t length,
                                                        serial_manager_transmission_mode_t mode )
    {
        serial_manager_write_handle_t * serialWriteHandle;
        serial_manager_handle_t * handle;

        #if ( defined( OSA_USED ) && defined( SERIAL_MANAGER_TASK_HANDLE_TX ) && ( SERIAL_MANAGER_TASK_HANDLE_TX == 1 ) )
            #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                /* Need to support common_task. */
            #else /* SERIAL_MANAGER_USE_COMMON_TASK */
                /* Do nothing. */
            #endif /* SERIAL_MANAGER_USE_COMMON_TASK */
        #else /* OSA_USED && SERIAL_MANAGER_TASK_HANDLE_TX */
            serial_manager_status_t status = kStatus_SerialManager_Success;
        #endif /* OSA_USED && SERIAL_MANAGER_TASK_HANDLE_TX */

        uint32_t primask;
        uint8_t isEmpty = 0U;

        assert( NULL != writeHandle );
        assert( NULL != buffer );
        assert( length > 0U );

        serialWriteHandle = ( serial_manager_write_handle_t * ) writeHandle;
        handle = serialWriteHandle->serialManagerHandle;
        assert( NULL != handle );
        #if ( defined( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE > 0U ) )
            if( ( handle->handleType == kSerialManager_Blocking ) || ( kSerialManager_TransmissionBlocking == mode ) )
            {
                return SerialManager_StartBlockWriting( handle, serialWriteHandle, buffer, length );
            }
        #endif /* SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE*/
        assert( SERIAL_MANAGER_WRITE_TAG == serialWriteHandle->tag );
        assert( !( ( kSerialManager_TransmissionNonBlocking == mode ) && ( NULL == serialWriteHandle->callback ) ) );

        primask = DisableGlobalIRQ();

        if( NULL != serialWriteHandle->transfer.buffer )
        {
            EnableGlobalIRQ( primask );
            return kStatus_SerialManager_Busy;
        }

        serialWriteHandle->transfer.buffer = buffer;
        serialWriteHandle->transfer.length = length;
        serialWriteHandle->transfer.soFar = 0U;
        serialWriteHandle->transfer.mode = mode;

        if( NULL == LIST_GetHead( &handle->runningWriteHandleHead ) )
        {
            isEmpty = 1U;
        }

        SerialManager_AddTail( &handle->runningWriteHandleHead, serialWriteHandle );
        EnableGlobalIRQ( primask );

        if( 0U != isEmpty )
        {
            #if ( defined( OSA_USED ) && defined( SERIAL_MANAGER_TASK_HANDLE_TX ) && ( SERIAL_MANAGER_TASK_HANDLE_TX == 1 ) )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                    /* Need to support common_task. */
                #else /* SERIAL_MANAGER_USE_COMMON_TASK */
                    ( void ) OSA_EventSet( ( osa_event_handle_t ) handle->event, SERIAL_EVENT_DATA_START_SEND );
                #endif /* SERIAL_MANAGER_USE_COMMON_TASK */
            #else /* OSA_USED && SERIAL_MANAGER_TASK_HANDLE_TX */
                status = SerialManager_StartWriting( handle );

                if( ( serial_manager_status_t ) kStatus_SerialManager_Success != status )
                {
                    #if ( defined( USB_CDC_SERIAL_MANAGER_RUN_NO_HOST ) && ( USB_CDC_SERIAL_MANAGER_RUN_NO_HOST == 1 ) )
                        if( status == kStatus_SerialManager_NotConnected )
                        {
                            SerialManager_RemoveHead( &handle->runningWriteHandleHead );
                            serialWriteHandle->transfer.buffer = 0U;
                            serialWriteHandle->transfer.length = 0U;
                        }
                    #endif /* USB_CDC_SERIAL_MANAGER_RUN_NO_HOST == 1 */
                    return status;
                }
            #endif /* OSA_USED && SERIAL_MANAGER_TASK_HANDLE_TX */
        }

        if( kSerialManager_TransmissionBlocking == mode )
        {
            while( serialWriteHandle->transfer.length > serialWriteHandle->transfer.soFar )
            {
                #if defined( __GIC_PRIO_BITS )
                    if( 0x13 == ( __get_CPSR() & CPSR_M_Msk ) )
                #else
                    if( 0U != __get_IPSR() )
                #endif
                {
                    SerialManager_IsrFunction( handle );
                }
                else
                {
                    SerialManager_WriteTimeDelay( SERIAL_MANAGER_WRITE_TIME_DELAY_DEFAULT_VALUE );
                }
            }
        }

        return kStatus_SerialManager_Success;
    }

    static serial_manager_status_t SerialManager_Read( serial_read_handle_t readHandle,
                                                       uint8_t * buffer,
                                                       uint32_t length,
                                                       serial_manager_transmission_mode_t mode,
                                                       uint32_t * receivedLength )
    {
        serial_manager_read_handle_t * serialReadHandle;
        serial_manager_handle_t * handle;
        uint32_t dataLength;
        uint32_t primask;

        assert( NULL != readHandle );
        assert( NULL != buffer );
        assert( length > 0U );

        serialReadHandle = ( serial_manager_read_handle_t * ) readHandle;

        handle = serialReadHandle->serialManagerHandle;
        assert( NULL != handle );
        #if ( defined( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE > 0U ) )
            if( handle->handleType == kSerialManager_Blocking )
            /* if ((handle->handleType == kSerialManager_Blocking) || (kSerialManager_TransmissionBlocking == mode)) */
            {
                return SerialManager_StartReading( handle, serialReadHandle, buffer, length );
            }
        #endif /* SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE*/
        assert( SERIAL_MANAGER_READ_TAG == serialReadHandle->tag );
        assert( !( ( kSerialManager_TransmissionNonBlocking == mode ) && ( NULL == serialReadHandle->callback ) ) );

        primask = DisableGlobalIRQ();

        if( NULL != serialReadHandle->transfer.buffer )
        {
            EnableGlobalIRQ( primask );
            return kStatus_SerialManager_Busy;
        }

        serialReadHandle->transfer.buffer = buffer;
        serialReadHandle->transfer.length = length;
        serialReadHandle->transfer.soFar = 0U;
        serialReadHandle->transfer.mode = mode;

        dataLength = handle->ringBuffer.ringHead + handle->ringBuffer.ringBufferSize - handle->ringBuffer.ringTail;
        dataLength = dataLength % handle->ringBuffer.ringBufferSize;

