FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
        for( serialReadHandle->transfer.soFar = 0U; serialReadHandle->transfer.soFar < MIN( dataLength, length );
             serialReadHandle->transfer.soFar++ )
        {
            buffer[ serialReadHandle->transfer.soFar ] = handle->ringBuffer.ringBuffer[ handle->ringBuffer.ringTail ];
            handle->ringBuffer.ringTail++;

            if( handle->ringBuffer.ringTail >= handle->ringBuffer.ringBufferSize )
            {
                handle->ringBuffer.ringTail = 0U;
            }
        }

        dataLength = handle->ringBuffer.ringHead + handle->ringBuffer.ringBufferSize - handle->ringBuffer.ringTail;
        dataLength = dataLength % handle->ringBuffer.ringBufferSize;
        dataLength = handle->ringBuffer.ringBufferSize - 1U - dataLength;

        ( void ) SerialManager_StartReading( handle, readHandle, NULL, dataLength );

        if( NULL != receivedLength )
        {
            *receivedLength = serialReadHandle->transfer.soFar;
            serialReadHandle->transfer.buffer = NULL;
            EnableGlobalIRQ( primask );
        }
        else
        {
            if( serialReadHandle->transfer.soFar >= serialReadHandle->transfer.length )
            {
                serialReadHandle->transfer.buffer = NULL;
                EnableGlobalIRQ( primask );

                if( kSerialManager_TransmissionNonBlocking == mode )
                {
                    if( NULL != serialReadHandle->callback )
                    {
                        serial_manager_callback_message_t msg;
                        msg.buffer = buffer;
                        msg.length = serialReadHandle->transfer.soFar;
                        serialReadHandle->callback( serialReadHandle->callbackParam, &msg, kStatus_SerialManager_Success );
                    }
                }
            }
            else
            {
                EnableGlobalIRQ( primask );
            }

            if( kSerialManager_TransmissionBlocking == mode )
            {
                while( serialReadHandle->transfer.length > serialReadHandle->transfer.soFar )
                {
                    SerialManager_ReadTimeDelay( SERIAL_MANAGER_READ_TIME_DELAY_DEFAULT_VALUE );
                }
            }
        }

        return kStatus_SerialManager_Success;
    }

#else  /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

    static serial_manager_status_t SerialManager_Write( serial_write_handle_t writeHandle,
                                                        uint8_t * buffer,
                                                        uint32_t length )
    {
        serial_manager_write_handle_t * serialWriteHandle;
        serial_manager_handle_t * handle;

        assert( writeHandle );
        assert( buffer );
        assert( length );

        serialWriteHandle = ( serial_manager_write_handle_t * ) writeHandle;
        handle = serialWriteHandle->serialManagerHandle;

        assert( handle );

        return SerialManager_StartWriting( handle, serialWriteHandle, buffer, length );
    }

    static serial_manager_status_t SerialManager_Read( serial_read_handle_t readHandle,
                                                       uint8_t * buffer,
                                                       uint32_t length )
    {
        serial_manager_read_handle_t * serialReadHandle;
        serial_manager_handle_t * handle;

        assert( readHandle );
        assert( buffer );
        assert( length );

        serialReadHandle = ( serial_manager_read_handle_t * ) readHandle;
        handle = serialReadHandle->serialManagerHandle;

        assert( handle );

        return SerialManager_StartReading( handle, serialReadHandle, buffer, length );
    }
#endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

serial_manager_status_t SerialManager_Init( serial_handle_t serialHandle,
                                            const serial_manager_config_t * config )
{
    serial_manager_handle_t * handle;
    serial_manager_status_t status = kStatus_SerialManager_Error;

    assert( NULL != config );

    assert( NULL != serialHandle );
    assert( SERIAL_MANAGER_HANDLE_SIZE >= sizeof( serial_manager_handle_t ) );

    handle = ( serial_manager_handle_t * ) serialHandle;
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        #if ( defined( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE > 0U ) )
            if( config->blockType == kSerialManager_Blocking )
            {
                ( void ) memset( handle, 0, SERIAL_MANAGER_BLOCK_HANDLE_SIZE );
            }
            else
        #endif /* SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE */
        {
            assert( NULL != config->ringBuffer );
            assert( config->ringBufferSize > 0U );
            ( void ) memset( handle, 0, SERIAL_MANAGER_HANDLE_SIZE );
        }

        handle->handleType = config->blockType;
    #else  /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */
        ( void ) memset( handle, 0, SERIAL_MANAGER_HANDLE_SIZE );
    #endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */
    handle->type = config->type;

    switch( config->type )
    {
        #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
            case kSerialPort_Uart:
                status = Serial_UartInit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), config->portConfig );
                #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
                    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE > 0U ) )
                        if( config->blockType == kSerialManager_Blocking )
                        {
                            return status;
                        }
                    #endif /* SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE */

                    if( ( serial_manager_status_t ) kStatus_SerialManager_Success == status )
                    {
                        ( void ) Serial_UartInstallTxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                               SerialManager_TxCallback, handle );

                        ( void ) Serial_UartInstallRxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                               SerialManager_RxCallback, handle );
                    }
                #endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */
                break;
        #endif /* if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) ) */
        #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
            case kSerialPort_UsbCdc:
                status = Serial_UsbCdcInit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), config->portConfig );
                #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
                    if( kStatus_SerialManager_Success == status )
                    {
                        status = Serial_UsbCdcInstallTxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                                 SerialManager_TxCallback, handle );

                        if( kStatus_SerialManager_Success == status )
                        {
                            status = Serial_UsbCdcInstallRxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                                     SerialManager_RxCallback, handle );
                        }
                    }
                #endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */
                break;
        #endif /* if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) ) */
        #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
            case kSerialPort_Swo:
                status = Serial_SwoInit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), config->portConfig );
                #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
                    if( kStatus_SerialManager_Success == status )
                    {
                        status = Serial_SwoInstallTxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                              SerialManager_TxCallback, handle );
                    }
                #endif
                break;
        #endif /* if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) ) */
        #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
            case kSerialPort_Virtual:
                status = Serial_PortVirtualInit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), config->portConfig );
                #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
                    if( kStatus_SerialManager_Success == status )
                    {
                        status = Serial_PortVirtualInstallTxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                                      SerialManager_TxCallback, handle );

                        if( kStatus_SerialManager_Success == status )
                        {
                            status = Serial_PortVirtualInstallRxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                                          SerialManager_RxCallback, handle );
                        }
                    }
                #endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */
                break;
        #endif /* if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) ) */
        #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
            case kSerialPort_Rpmsg:
                status = Serial_RpmsgInit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ), ( void * ) config );
                #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
                    if( kStatus_SerialManager_Success == status )
                    {
                        status = Serial_RpmsgInstallTxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                                SerialManager_TxCallback, handle );

                        if( kStatus_SerialManager_Success == status )
                        {
                            status = Serial_RpmsgInstallRxCallback( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ),
                                                                    SerialManager_RxCallback, handle );
                        }
                    }
                #endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */
                break;
        #endif /* if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) ) */
        default:
            /*MISRA rule 16.4*/
            break;
    }

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        #if defined( OSA_USED )
            #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                COMMON_TASK_init();
            #else
                if( KOSA_StatusSuccess != OSA_EventCreate( ( osa_event_handle_t ) handle->event, 1U ) )
                {
                    return kStatus_SerialManager_Error;
                }

                if( KOSA_StatusSuccess != OSA_TaskCreate( ( osa_task_handle_t ) handle->taskId, OSA_TASK( SerialManager_Task ), handle ) )
                {
                    return kStatus_SerialManager_Error;
                }
            #endif /* if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) ) */
        #endif /* if defined( OSA_USED ) */
    #endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        handle->ringBuffer.ringBuffer = config->ringBuffer;
        handle->ringBuffer.ringBufferSize = config->ringBufferSize;
    #endif
    return status;
}

