FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
serial_manager_status_t SerialManager_Deinit( serial_handle_t serialHandle )
{
    serial_manager_handle_t * handle;
    uint32_t primask;
    serial_manager_status_t serialManagerStatus = kStatus_SerialManager_Success;

    assert( NULL != serialHandle );

    handle = ( serial_manager_handle_t * ) serialHandle;

    primask = DisableGlobalIRQ();

    if( ( NULL != handle->openedReadHandleHead ) || ( 0U != handle->openedWriteHandleCount ) )
    {
        serialManagerStatus = kStatus_SerialManager_Busy; /*Serial Manager Busy*/
    }
    else
    {
        switch( handle->type ) /*serial port type*/
        {
            #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
                case kSerialPort_Uart:
                    ( void ) Serial_UartDeinit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
                case kSerialPort_UsbCdc:
                    ( void ) Serial_UsbCdcDeinit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
                case kSerialPort_Swo:
                    ( void ) Serial_SwoDeinit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
                case kSerialPort_Virtual:
                    ( void ) Serial_PortVirtualDeinit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
                case kSerialPort_Rpmsg:
                    ( void ) Serial_RpmsgDeinit( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                    break;
            #endif
            default:
                /*MISRA rule 16.4*/
                break;
        }

        #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
            #if defined( OSA_USED )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                #else
                    ( void ) OSA_EventDestroy( ( osa_event_handle_t ) handle->event );
                    ( void ) OSA_TaskDestroy( ( osa_task_handle_t ) handle->taskId );
                #endif
            #endif
        #endif
    }

    EnableGlobalIRQ( primask );
    return serialManagerStatus;
}

serial_manager_status_t SerialManager_OpenWriteHandle( serial_handle_t serialHandle,
                                                       serial_write_handle_t writeHandle )
{
    serial_manager_handle_t * handle;
    serial_manager_write_handle_t * serialWriteHandle;
    uint32_t primask;

    assert( NULL != serialHandle );
    assert( NULL != writeHandle );
    assert( SERIAL_MANAGER_WRITE_HANDLE_SIZE >= sizeof( serial_manager_write_handle_t ) );

    handle = ( serial_manager_handle_t * ) serialHandle;
    serialWriteHandle = ( serial_manager_write_handle_t * ) writeHandle;

    primask = DisableGlobalIRQ();
    handle->openedWriteHandleCount++;
    EnableGlobalIRQ( primask );
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        if( handle->handleType == kSerialManager_Blocking )
        {
            serialWriteHandle->serialManagerHandle = handle;
            return kStatus_SerialManager_Success;
        }
        else
    #endif
    {
        ( void ) memset( writeHandle, 0, SERIAL_MANAGER_WRITE_HANDLE_SIZE );
    }

    serialWriteHandle->serialManagerHandle = handle;

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        serialWriteHandle->tag = SERIAL_MANAGER_WRITE_TAG;
    #endif

    return kStatus_SerialManager_Success;
}

serial_manager_status_t SerialManager_CloseWriteHandle( serial_write_handle_t writeHandle )
{
    serial_manager_handle_t * handle;
    serial_manager_write_handle_t * serialWriteHandle;
    uint32_t primask;

    assert( NULL != writeHandle );

    serialWriteHandle = ( serial_manager_write_handle_t * ) writeHandle;
    handle = ( serial_manager_handle_t * ) ( void * ) serialWriteHandle->serialManagerHandle;

    assert( NULL != handle );
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        assert( SERIAL_MANAGER_WRITE_TAG == serialWriteHandle->tag );
    #endif

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        ( void ) SerialManager_CancelWriting( writeHandle );
    #endif
    primask = DisableGlobalIRQ();

    if( handle->openedWriteHandleCount > 0U )
    {
        handle->openedWriteHandleCount--;
    }

    EnableGlobalIRQ( primask );

    ( void ) memset( writeHandle, 0, SERIAL_MANAGER_WRITE_HANDLE_SIZE );

    return kStatus_SerialManager_Success;
}

serial_manager_status_t SerialManager_OpenReadHandle( serial_handle_t serialHandle,
                                                      serial_read_handle_t readHandle )
{
    serial_manager_handle_t * handle;
    serial_manager_read_handle_t * serialReadHandle; /* read handle structure */
    serial_manager_status_t serialManagerStatus = kStatus_SerialManager_Success;
    uint32_t primask;

    assert( NULL != serialHandle );
    assert( NULL != readHandle );
    assert( SERIAL_MANAGER_READ_HANDLE_SIZE >= sizeof( serial_manager_read_handle_t ) );

    handle = ( serial_manager_handle_t * ) serialHandle;
    serialReadHandle = ( serial_manager_read_handle_t * ) readHandle;
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        if( handle->handleType == kSerialManager_Blocking )
        {
            serialReadHandle->serialManagerHandle = handle;
            return kStatus_SerialManager_Success;
        }
    #endif
    primask = DisableGlobalIRQ();

    if( handle->openedReadHandleHead != NULL )
    {
        serialManagerStatus = kStatus_SerialManager_Busy;
    }
    else
    {
        handle->openedReadHandleHead = serialReadHandle;

        ( void ) memset( readHandle, 0, SERIAL_MANAGER_READ_HANDLE_SIZE );

