FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
        serialReadHandle->serialManagerHandle = handle;
        #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
            serialReadHandle->tag = SERIAL_MANAGER_READ_TAG;
        #endif
    }

    EnableGlobalIRQ( primask );
    return serialManagerStatus;
}

serial_manager_status_t SerialManager_CloseReadHandle( serial_read_handle_t readHandle )
{
    serial_manager_handle_t * handle;
    serial_manager_read_handle_t * serialReadHandle;
    uint32_t primask;

    assert( NULL != readHandle );

    serialReadHandle = ( serial_manager_read_handle_t * ) readHandle;
    handle = ( serial_manager_handle_t * ) ( void * ) serialReadHandle->serialManagerHandle;

    assert( ( NULL != handle ) && ( handle->openedReadHandleHead == serialReadHandle ) );
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        assert( SERIAL_MANAGER_READ_TAG == serialReadHandle->tag );
    #endif

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        ( void ) SerialManager_CancelReading( readHandle );
    #endif

    primask = DisableGlobalIRQ();
    handle->openedReadHandleHead = NULL;
    EnableGlobalIRQ( primask );

    ( void ) memset( readHandle, 0, SERIAL_MANAGER_READ_HANDLE_SIZE );

    return kStatus_SerialManager_Success;
}

serial_manager_status_t SerialManager_WriteBlocking( serial_write_handle_t writeHandle,
                                                     uint8_t * buffer,
                                                     uint32_t length )
{
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        return SerialManager_Write( writeHandle, buffer, length, kSerialManager_TransmissionBlocking );
    #else
        return SerialManager_Write( writeHandle, buffer, length );
    #endif
}

serial_manager_status_t SerialManager_ReadBlocking( serial_read_handle_t readHandle,
                                                    uint8_t * buffer,
                                                    uint32_t length )
{
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        return SerialManager_Read( readHandle, buffer, length, kSerialManager_TransmissionBlocking, NULL );
    #else
        return SerialManager_Read( readHandle, buffer, length );
    #endif
}

#if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
    serial_manager_status_t SerialManager_WriteNonBlocking( serial_write_handle_t writeHandle,
                                                            uint8_t * buffer,
                                                            uint32_t length )
    {
        return SerialManager_Write( writeHandle, buffer, length, kSerialManager_TransmissionNonBlocking );
    }

    serial_manager_status_t SerialManager_ReadNonBlocking( serial_read_handle_t readHandle,
                                                           uint8_t * buffer,
                                                           uint32_t length )
    {
        return SerialManager_Read( readHandle, buffer, length, kSerialManager_TransmissionNonBlocking, NULL );
    }

    serial_manager_status_t SerialManager_CancelWriting( serial_write_handle_t writeHandle )
    {
        serial_manager_write_handle_t * serialWriteHandle;
        uint32_t primask;
        uint8_t isNotUsed = 0U;
        uint8_t isNotNeed2Cancel = 0U;

        assert( NULL != writeHandle );

        serialWriteHandle = ( serial_manager_write_handle_t * ) writeHandle;

        assert( NULL != serialWriteHandle->serialManagerHandle );
        assert( SERIAL_MANAGER_WRITE_TAG == serialWriteHandle->tag );

        if( ( NULL != serialWriteHandle->transfer.buffer ) &&
            ( kSerialManager_TransmissionBlocking == serialWriteHandle->transfer.mode ) )
        {
            return kStatus_SerialManager_Error;
        }

        primask = DisableGlobalIRQ();

        if( serialWriteHandle !=
            ( serial_manager_write_handle_t * ) ( ( uint32_t ) LIST_GetHead(
                                                      &serialWriteHandle->serialManagerHandle->runningWriteHandleHead ) -
                                                  4U ) )
        {
            if( kLIST_Ok == LIST_RemoveElement( &serialWriteHandle->link ) )
            {
                isNotUsed = 1U;
            }
            else
            {
                isNotNeed2Cancel = 1U;
            }
        }

        EnableGlobalIRQ( primask );

        if( 0U == isNotNeed2Cancel )
        {
            if( 0U != isNotUsed )
            {
                serialWriteHandle->transfer.soFar = 0;
                serialWriteHandle->transfer.status = kStatus_SerialManager_Canceled;

                SerialManager_AddTail( &serialWriteHandle->serialManagerHandle->completedWriteHandleHead, serialWriteHandle );
                #if defined( OSA_USED )
                    #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                        serialWriteHandle->serialManagerHandle->commontaskMsg.callback = SerialManager_Task;
                        serialWriteHandle->serialManagerHandle->commontaskMsg.callbackParam =
                            serialWriteHandle->serialManagerHandle;
                        COMMON_TASK_post_message( &serialWriteHandle->serialManagerHandle->commontaskMsg );
                    #else
                        ( void ) OSA_EventSet( ( osa_event_handle_t ) serialWriteHandle->serialManagerHandle->event,
                                               SERIAL_EVENT_DATA_SENT );
                    #endif
                #else
                    SerialManager_Task( serialWriteHandle->serialManagerHandle );
                #endif /* if defined( OSA_USED ) */
            }
            else
            {
                switch( serialWriteHandle->serialManagerHandle->type )
                {
                    #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
                        case kSerialPort_Uart:
                            ( void ) Serial_UartCancelWrite(
                                ( ( serial_handle_t ) &serialWriteHandle->serialManagerHandle->lowLevelhandleBuffer[ 0 ] ) );
                            break;
                    #endif
                    #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
                        case kSerialPort_UsbCdc:
                            ( void ) Serial_UsbCdcCancelWrite(
                                ( ( serial_handle_t ) &serialWriteHandle->serialManagerHandle->lowLevelhandleBuffer[ 0 ] ) );
                            break;
                    #endif
                    #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
                        case kSerialPort_Swo:
                            ( void ) Serial_SwoCancelWrite(
                                ( ( serial_handle_t ) &serialWriteHandle->serialManagerHandle->lowLevelhandleBuffer[ 0 ] ) );
                            break;
                    #endif
                    #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
                        case kSerialPort_Virtual:
                            ( void ) Serial_PortVirtualCancelWrite(
                                ( ( serial_handle_t ) &serialWriteHandle->serialManagerHandle->lowLevelhandleBuffer[ 0 ] ) );
                            break;
                    #endif
                    default:
                        /*MISRA rule 16.4*/
                        break;
                }
            }

            #if ( defined( OSA_USED ) && defined( SERIAL_MANAGER_TASK_HANDLE_TX ) && ( SERIAL_MANAGER_TASK_HANDLE_TX == 1 ) )
                #if ( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) )
                    /* Need to support common_task. */
                #else /* SERIAL_MANAGER_USE_COMMON_TASK */
                    ( void ) OSA_EventSet( ( osa_event_handle_t ) &serialWriteHandle->serialManagerHandle->event,
                                           SERIAL_EVENT_DATA_START_SEND );
                #endif /* SERIAL_MANAGER_USE_COMMON_TASK */
            #else /* OSA_USED && SERIAL_MANAGER_TASK_HANDLE_TX */
                ( void ) SerialManager_StartWriting( serialWriteHandle->serialManagerHandle );
            #endif /* OSA_USED && SERIAL_MANAGER_TASK_HANDLE_TX */
        }

        return kStatus_SerialManager_Success;
    }

    serial_manager_status_t SerialManager_CancelReading( serial_read_handle_t readHandle )
    {
        serial_manager_read_handle_t * serialReadHandle;
        serial_manager_callback_message_t msg;
        uint8_t * buffer;
        uint32_t primask;

        assert( NULL != readHandle );

        serialReadHandle = ( serial_manager_read_handle_t * ) readHandle;

