FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.c
        assert( SERIAL_MANAGER_READ_TAG == serialReadHandle->tag );

        if( ( NULL != serialReadHandle->transfer.buffer ) &&
            ( kSerialManager_TransmissionBlocking == serialReadHandle->transfer.mode ) )
        {
            return kStatus_SerialManager_Error;
        }

        primask = DisableGlobalIRQ();
        buffer = serialReadHandle->transfer.buffer;
        serialReadHandle->transfer.buffer = NULL;
        serialReadHandle->transfer.length = 0;
        msg.buffer = buffer;
        msg.length = serialReadHandle->transfer.soFar;
        EnableGlobalIRQ( primask );

        if( NULL != buffer )
        {
            if( NULL != serialReadHandle->callback )
            {
                serialReadHandle->callback( serialReadHandle->callbackParam, &msg, kStatus_SerialManager_Canceled );
            }
        }

        return kStatus_SerialManager_Success;
    }

    serial_manager_status_t SerialManager_TryRead( serial_read_handle_t readHandle,
                                                   uint8_t * buffer,
                                                   uint32_t length,
                                                   uint32_t * receivedLength )
    {
        assert( NULL != receivedLength );

        return SerialManager_Read( readHandle, buffer, length, kSerialManager_TransmissionBlocking, receivedLength );
    }

    serial_manager_status_t SerialManager_InstallTxCallback( serial_write_handle_t writeHandle,
                                                             serial_manager_callback_t callback,
                                                             void * callbackParam )
    {
        serial_manager_write_handle_t * serialWriteHandle;

        assert( NULL != writeHandle );

        serialWriteHandle = ( serial_manager_write_handle_t * ) writeHandle;

        assert( SERIAL_MANAGER_WRITE_TAG == serialWriteHandle->tag );

        serialWriteHandle->callbackParam = callbackParam;
        serialWriteHandle->callback = callback;

        return kStatus_SerialManager_Success;
    }

    serial_manager_status_t SerialManager_InstallRxCallback( serial_read_handle_t readHandle,
                                                             serial_manager_callback_t callback,
                                                             void * callbackParam )
    {
        serial_manager_read_handle_t * serialReadHandle;

        assert( NULL != readHandle );

        serialReadHandle = ( serial_manager_read_handle_t * ) readHandle;

        assert( SERIAL_MANAGER_READ_TAG == serialReadHandle->tag );

        serialReadHandle->callbackParam = callbackParam;
        serialReadHandle->callback = callback;

        return kStatus_SerialManager_Success;
    }
#endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

serial_manager_status_t SerialManager_EnterLowpower( serial_handle_t serialHandle )
{
    serial_manager_handle_t * handle;
    serial_manager_status_t status = kStatus_SerialManager_Error;

    assert( NULL != serialHandle );

    handle = ( serial_manager_handle_t * ) serialHandle;

    switch( handle->type )
    {
        #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
            case kSerialPort_Uart:
                status = Serial_UartEnterLowpower( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                break;
        #endif
        #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
            case kSerialPort_UsbCdc:
                break;
        #endif
        #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
            case kSerialPort_Swo:
                break;
        #endif
        #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
            case kSerialPort_Virtual:
                break;
        #endif
        #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
            case kSerialPort_Rpmsg:
                break;
        #endif
        default:
            /*MISRA rule 16.4*/
            break;
    }

    return status;
}

serial_manager_status_t SerialManager_ExitLowpower( serial_handle_t serialHandle )
{
    serial_manager_handle_t * handle;
    serial_manager_status_t status = kStatus_SerialManager_Error;

    assert( NULL != serialHandle );

    handle = ( serial_manager_handle_t * ) serialHandle;

    switch( handle->type )
    {
        #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
            case kSerialPort_Uart:
                status = Serial_UartExitLowpower( ( ( serial_handle_t ) &handle->lowLevelhandleBuffer[ 0 ] ) );
                break;
        #endif
        #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
            case kSerialPort_UsbCdc:
                break;
        #endif
        #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
            case kSerialPort_Swo:
                break;
        #endif
        #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
            case kSerialPort_Virtual:
                break;
        #endif
        #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )
            case kSerialPort_Rpmsg:
                break;
        #endif
        default:
            /*MISRA rule 16.4*/
            break;
    }

    return status;
}
